app/controllers/images_controller.rb

  def index
    @images = Image.order(created_at: :desc).limit(15)
---
SELECT  "images".* FROM "images" ORDER BY "images"."created_at" DESC LIMIT ?  [["LIMIT", 15]]

  def show
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @image = current_user.images.build(image_params)
    if @image.save
---
INSERT INTO "images" ("user_id", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", "2020-04-26 12:05:49.805258"], ["updated_at", "2020-04-26 12:05:49.805258"], ["description", "my insta\r\n"]]