app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["image_id", 4], ["created_at", "2020-04-29 15:12:03.208240"], ["updated_at", "2020-04-29 15:12:03.208240"]]
---
  def create
  if already_liked?
    flash[:notice] = "You can't like more than once"
  else
    @image.likes.create(user: current_user)

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    if !(already_liked?)
      flash[:notice] = "Cannot unlike"
    else
      @like.destroy

SELECT  "likes".* FROM "likes" WHERE "likes"."image_id" = ? AND "likes"."id" = ? LIMIT ?  [["image_id", 3], ["id", 2], ["LIMIT", 1]]
---
  def find_like
   @like = @image.likes.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_post
    @image = Image.find(params[:image_id])

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."image_id" = ? LIMIT ?  [["user_id", 2], ["image_id", 4], ["LIMIT", 1]]
---
  def already_liked?
    Like.where(user: current_user, image_id:
    params[:image_id]).exists?