app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Username"], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE "images"."user_id" = ? ORDER BY "images"."created_at" DESC  [["user_id", 1]]
---
  def show
    @user = User.find_by(username: params[:username])
    @images = @user.images.order(created_at: :desc)