app/models/user.rb

SELECT COUNT(*) FROM "followers" WHERE "followers"."follower_id" = ?  [["follower_id", 2]]
---
  def total_followers
    Follower.where(follower_id: self.id).count

SELECT COUNT(*) FROM "followers" WHERE "followers"."following_id" = ?  [["following_id", 2]]
---
  def total_following
    Follower.where(following_id: self.id).count