app/views/images/index.html.erb

                <div class="post-actions">
                  <% pre_like = image.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."image_id" = ?  [["image_id", 4]]

                  <% end %>
                  <p><strong><%= image.likes.count %> <%= (image.likes.count) == 1 ? 'Like' : 'Likes'%></strong></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."image_id" = ?  [["image_id", 4]]